In [ ]:
#what is csv
#csv format is a plain text format in which values are sepperated by commas(comma seperated values)

In [ ]:
#what is excel
#XLS file format is an excel sheets binay file format which hlds information about all the worksheets in a file,
#including both content  and formating

In [2]:
#pandas is built on numpy package
#pandas is a library used to deal with data analysis and manupulation
#it also helps us to organise data by putting it in a tabular form
import pandas as pd

In [3]:
#OS module in python provides a way of using os dependent functionality
#it allows u to interface with underlying operating system that pytho is running on
import os

In [4]:
#os.getcwd returns the current working directory of a process
os.getcwd()

'C:\\Users\\acer'

In [5]:
#os.chdir is used to change the current working directory to specified path
os.chdir('E:\Dataframes_csvFiles')

In [6]:
# to know about current working directory
os.getcwd()

'E:\\Dataframes_csvFiles'

# read csv file

In [7]:
# reading the dateframe using csv file
df=pd.read_csv('stock_data.csv')

In [8]:
df

  tickers            eps  revenue price         people
0  Google          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [9]:
#here row1 is additional 
#to skip that row while displaying/reading we write skiprows=row_number or header=rownumber
df=pd.read_csv('stock_data.csv',skiprows=1)

In [10]:
df

  Google          27.82   87   845     larry page
0    WMT           4.61  484    65           n.a.
1   MSFT             -1   85    64     bill gates
2    RIL  not available   50  1023  mukesh ambani
3   TATA            5.6   -1  n.a.     ratan tata

In [11]:
#here row1 is additional 
#to skip that row while displaying/reading we write skiprows=row_number or header=rownumber
df=pd.read_csv('stock_data.csv',header=1)

In [12]:
df

  Google          27.82   87   845     larry page
0    WMT           4.61  484    65           n.a.
1   MSFT             -1   85    64     bill gates
2    RIL  not available   50  1023  mukesh ambani
3   TATA            5.6   -1  n.a.     ratan tata

In [13]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
#suppose there is no header i.e., no title for each columns
#...😑😐deleting header from csv file
df=pd.read_csv('stock_data.csv')

In [15]:
df

  tickers            eps  revenue price         people
0  Google          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [16]:
#here first row is displayed as header 
#but we know that its not a header
#to skip the header we skiprows=None or header=None
df=pd.read_csv('stock_data.csv',header=None)

In [17]:
#here now the header is displayed as default by numbers 
df

         0              1        2      3              4
0  tickers            eps  revenue  price         people
1   Google          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4      RIL  not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [18]:
#since its not appropiate to understand the dataframe without heading
#we provide the names to these columns as parameters while reading i.e., 
df=pd.read_csv('stock_data.csv', header=None, names=['tickers','eps','revenue','price','people'])

In [19]:
#it doesnot effect your csv file
df

   tickers            eps  revenue  price         people
0  tickers            eps  revenue  price         people
1   Google          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4      RIL  not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [20]:
#writing the heading (header) in csv file as before 
df=pd.read_csv('stock_data.csv')

In [21]:
df

  tickers            eps  revenue price         people
0  Google          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [22]:
#suppose we want to read only few  rows
#then we mention nrows=no_of_rows_tobe_read, while reading the file
df=pd.read_csv('stock_data.csv',nrows=3)

In [23]:
df

  tickers    eps  revenue  price      people
0  Google  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [24]:
#if it is after reading the file then,
df.head(3)

  tickers    eps  revenue  price      people
0  Google  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [25]:
df

  tickers    eps  revenue  price      people
0  Google  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [26]:
#observe the above cell(dataframe)..values are missing
#suppose if there are few values missing in the dataframe i.e., not avaiable/n.a.
#And you want to replace them with Nan
#we write as na_values['not avaiable','n.a.']
df=pd.read_csv('stock_data.csv',na_values=['not available','n.a.'])

In [27]:
df

  tickers    eps  revenue   price         people
0  Google  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3     RIL    NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [28]:
#there might be few error in the dataset
#As observed in our dataset,revenue cannot be -1 
#if we place -1 by na_values(list)...eps value also gets changed
df=pd.read_csv('stock_data.csv',na_values=['not available','n.a.','-1'])

In [29]:
df

  tickers    eps  revenue   price         people
0  Google  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [35]:
#eps(-1) value has been changed which is an error
#we only need to change revenue(-1) value coz revenue cannot be negative
#this can be done by using dictionary inspite of list
df=pd.read_csv('stock_data.csv',na_values={
    'eps':['not available','n.a.'],
    'revenue':['not available','n.a.','-1'],
   'people': ['not available','n.a.','-1']
})

In [36]:
df

  tickers    eps  revenue price         people
0  Google  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3     RIL    NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

# write csv file

In [38]:
#after correcting the given dataframe
#we can store/write it into a new csv file
#DataFrame.to_csv('file_name.csv') helps to create a new csv file
df.to_csv('new_stock_data.csv')

# A new csv file is created in the current working directory
#by default it even writes the index

In [39]:
df

  tickers    eps  revenue price         people
0  Google  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3     RIL    NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [81]:
#to remove the index
df.to_csv('new_stock_data.csv',index=False)

#if it shows error as permission denied 
#make sure to close the csv file
#output:open csv_file in the cwd(current working directory)

In [43]:
df

  tickers    eps  revenue price         people
0  Google  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3     RIL    NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [49]:
#suppose we want to import only 2 columns in our new csv file
df.to_csv('new_stock_data.csv',columns=['tickers','eps'])

#output:open csv_file in the cwd(current working directory)
#by defaults it displays index

In [51]:
#to remove index
df.to_csv('new_stock_data.csv',index=False,columns=['tickers','eps'])

#output:open csv_file in the cwd(current working directory)

In [54]:
#to skip header,we write header=False
df.to_csv('new_stock_data.csv',index=False,header=False)

#output:open csv_file in the cwd(current working directory)

# read excel file

In [58]:
#os.getcwd returns the current working directory of a process
os.getcwd()

'E:\\Dataframes_csvFiles'

In [61]:
# reading the dateframe using excel 
df=pd.read_excel('stock_data.xlsx')

In [62]:
df

  tickers            eps  revenue price         people
0  Google          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [75]:
#suppose if we want to change/convert the value of n.a.
#we define a function and call that function while reading the excel
def convert_people_cell(cell):
    if cell=='n.a.':
        return 'sam walton'
    return cell
def convert_eps_cell(cell):
    if cell=='not available':
        return None
    return cell

#None = Nan

In [78]:
#converters are used to convert some messy data into meaning full data
#calling the function while reading by converters using dictionary
df=pd.read_excel('stock_data.xlsx',converters={
    'people':convert_people_cell,
    'eps':convert_eps_cell
})

In [79]:
#it doesnot effect  excel sheet
df

  tickers    eps  revenue price         people
0  Google  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3     RIL    NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

# write excel file

In [86]:
#we can store/write it into a new excel sheet
#DataFrame.to_excel('file_name.xlsx') helps to create a new excel sheet
df.to_excel('new_stock_data.xlsx')

# A new excel sheet is created in the current working directory
#by default it even writes the index
#output: open  this new excel sheet in cwd(current working directory)

In [89]:
#to remove default index 
df.to_excel('new_stock_data.xlsx',index=False)

#output:open excel sheet in cwd(current working directory)

In [91]:
#suppose we want to import only 2 columns in our new excel sheet
df.to_excel('new_stock_data.xlsx',columns=['tickers','eps'])

#output:open excel sheet in the cwd(current working directory)
#by defaults it displays index

In [94]:
#to remove index
df.to_excel('new_stock_data.xlsx',index=False,columns=['tickers','eps'])

#output:open excel sheet in the cwd(current working directory)

In [97]:
#suppose if we want to start dataframe from a specified row and column in excel sheet
df.to_excel('new_stock_data.xlsx',startrow=5,startcol=4,index=False)

#output:open excel sheet in folder

In [98]:
df

  tickers    eps  revenue price         people
0  Google  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3     RIL    NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

# 2 dataframes in different excl sheet

In [111]:
#creating dataframe-1 using dictionary

weather_data=pd.DataFrame({
    "day":['1/1/2020','1/2/2020','1/3/2020','1/4/2020','1/5/2020'],
    "temp":[32,33,34,28,30],
    "windspeed":[6,7,8,2,4],
    "event":["rain","sunny","rain","snow","sunny"]
})

In [110]:
#creating dataframe-2 using dictionary

stock_data=pd.DataFrame({
    "tickers":['Google','WMT','MSFT','RIL','TATA'],
    "eps":[27.82,4.61,-1,7,5.60],
    "revenue":[87,484,85,50,-1],
    "price":[845,65,64,1023,87]
})

In [114]:
with pd.ExcelWriter('weather_stock.xlsx') as writer:
    stock_data.to_excel(writer,sheet_name='stocks')
    weather_data.to_excel(writer,sheet_name='weather')
    
#output:open excel sheet in folder ,you will observe 2 sheets in it